jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/ports/secure_sockets/iot_secure_sockets.c
//    if ((pxContext != SOCKETS_INVALID_SOCKET) && (pxAddress != NULL))
      if ((xSocket != SOCKETS_INVALID_SOCKET) && (pxAddress != NULL))
      {
        pxContext->xConnectAttempted = pdTRUE;	// RX65N Cloud Kit 20200923
        ret = R_WIFI_SX_ULPGN_ConnectSocket (pxContext->socket_no, SOCKETS_ntohl(pxAddress->ulAddress),
                                             SOCKETS_ntohs(pxAddress->usPort), pxContext->pcDestination);
        if (WIFI_SUCCESS != ret)
        {
            lStatus = SOCKETS_SOCKET_ERROR;
        }

#if defined(__RL) || defined(__CCRL__)
        NOP();
#else
        /* Negotiate TLS if requested. */
        if( ( SOCKETS_ERROR_NONE == lStatus ) && ( pdTRUE == pxContext->xRequireTLS ) )
        {
            xTLSParams.ulSize = sizeof( xTLSParams );
            xTLSParams.pcDestination = pxContext->pcDestination;
            xTLSParams.pcServerCertificate = pxContext->pcServerCertificate;
            xTLSParams.ulServerCertificateLength = pxContext->ulServerCertificateLength;
            xTLSParams.pvCallerContext = pxContext;
            xTLSParams.pxNetworkRecv = prvNetworkRecv;
            xTLSParams.pxNetworkSend = prvNetworkSend;
            lStatus = TLS_Init( &pxContext->pvTLSContext, &xTLSParams );

            if( SOCKETS_ERROR_NONE == lStatus )
            {
                lStatus = TLS_Connect( pxContext->pvTLSContext );
                if( lStatus < 0 )
                {
                    lStatus = SOCKETS_TLS_HANDSHAKE_ERROR;
                }
            }
        }
#endif
    }
    else
    {
        lStatus = SOCKETS_SOCKET_ERROR;
    }

    return lStatus;
}
/*-----------------------------------------------------------*/

/**
 * @brief Receive data from a TCP socket.
 *
 * The socket must have already been created using a call to SOCKETS_Socket()
 * and connected to a remote socket using SOCKETS_Connect().
 *
 * @param[in] xSocket The handle of the socket from which data is being received.
 * @param[out] pvBuffer The buffer into which the received data will be placed.
 * @param[in] xBufferLength The maximum number of bytes which can be received.
 * pvBuffer must be at least xBufferLength bytes long.
 * @param[in] ulFlags Not currently used. Should be set to 0.
 *
 * @return
 * * If the receive was successful then the number of bytes received (placed in the
 *   buffer pointed to by pvBuffer) is returned.
 * * If a timeout occurred before data could be received then 0 is returned (timeout
 *   is set using @ref SOCKETS_SO_RCVTIMEO).
 * * If an error occured, a negative value is returned. @ref SocketsErrors
 */
int32_t SOCKETS_Recv(Socket_t xSocket, void *pvBuffer, size_t xBufferLength, uint32_t ulFlags)
{
    int32_t lStatus = SOCKETS_SOCKET_ERROR;
    SSOCKETContextPtr_t pxContext = (SSOCKETContextPtr_t ) xSocket; /*lint !e9087 cast used for portability. */

// RX65N Cloud Kit 20200923    pxContext->xRecvFlags = ( BaseType_t ) ulFlags;

    if ((xSocket != SOCKETS_INVALID_SOCKET) && (pvBuffer != NULL))
    {
#if defined(__RL) || defined(__CCRL__) /* rl78/g23 20210721 */
        pxContext->xRecvFlags = ( BaseType_t ) ulFlags;

        /* Receive unencrypted. */
        lStatus = prvNetworkRecv (pxContext, pvBuffer, xBufferLength);
#else
        if( pdTRUE == pxContext->xRequireTLS )
        {
        	pxContext->xRecvFlags = ( BaseType_t ) ulFlags;	// RX65N Cloud Kit 20200923

            /* Receive through TLS pipe, if negotiated. */
            lStatus = TLS_Recv( pxContext->pvTLSContext, pvBuffer, xBufferLength );
        }
        else
        {
            /* Receive unencrypted. */
            lStatus = prvNetworkRecv( pxContext, pvBuffer, xBufferLength );
        }
#endif
    }
//    vTaskDelay( 1 );	// RX65N Cloud Kit 20200923 LastWillAndTestament テストPASSのために 暫定的に挿入
    return lStatus;
}
/*-----------------------------------------------------------*/

/**
 * @brief Transmit data to the remote socket.
 *
 * The socket must have already been created using a call to SOCKETS_Socket() and
 * connected to a remote socket using SOCKETS_Connect().
 *
 * @param[in] xSocket The handle of the sending socket.
 * @param[in] pvBuffer The buffer containing the data to be sent.
 * @param[in] xDataLength The length of the data to be sent.
 * @param[in] ulFlags Not currently used. Should be set to 0.
 *
 * @return
 * * On success, the number of bytes actually sent is returned.
 * * If an error occured, a negative value is returned. @ref SocketsErrors
 */
int32_t SOCKETS_Send(Socket_t xSocket, const void *pvBuffer, size_t xDataLength, uint32_t ulFlags)
{
    int32_t lStatus = SOCKETS_SOCKET_ERROR;
    SSOCKETContextPtr_t pxContext = (SSOCKETContextPtr_t ) xSocket; /*lint !e9087 cast used for portability. */

    if ((xSocket != SOCKETS_INVALID_SOCKET) && (pvBuffer != NULL))
    {
        pxContext->xSendFlags = (BaseType_t ) ulFlags;

#if defined(__RL) || defined(__CCRL__)
        /* Send unencrypted. */
        lStatus = prvNetworkSend (pxContext, pvBuffer, xDataLength);
#else
        if( pdTRUE == pxContext->xRequireTLS )
        {
            /* Send through TLS pipe, if negotiated. */
            lStatus = TLS_Send( pxContext->pvTLSContext, pvBuffer, xDataLength );
        }
        else
        {
            /* Send unencrypted. */
            lStatus = prvNetworkSend( pxContext, pvBuffer, xDataLength );
        }
#endif
    }
//	vTaskDelay( 1 );	// RX65N Cloud Kit 20200923 OTA E2EテストPASSのために 暫定的に挿入
    return lStatus;
}
/*-----------------------------------------------------------*/

/**
 * @brief Closes all or part of a full-duplex connection on the socket.
 *
 * @param[in] xSocket The handle of the socket to shutdown.
 * @param[in] ulHow SOCKETS_SHUT_RD, SOCKETS_SHUT_WR or SOCKETS_SHUT_RDWR.
 * @ref ShutdownFlags
 *
 * @return
 * * If the operation was successful, 0 is returned.
 * * If an error occured, a negative value is returned. @ref SocketsErrors
 */
int32_t SOCKETS_Shutdown(Socket_t xSocket, uint32_t ulHow)
{
    int32_t lStatus = SOCKETS_SOCKET_ERROR;
    wifi_err_t wifi_ret;
    SSOCKETContextPtr_t pxContext = (SSOCKETContextPtr_t ) xSocket; /*lint !e9087 cast used for portability. */

    if (( NULL == pxContext) || (pxContext == SOCKETS_INVALID_SOCKET)
            || (pxContext->socket_no >= MAX_NUM_SSOCKETS))
    {
        return SOCKETS_EINVAL;
    }
    else if ((ulHow != SOCKETS_SHUT_RD) && (ulHow != SOCKETS_SHUT_WR) && (ulHow != SOCKETS_SHUT_RDWR))
    {
        return SOCKETS_EINVAL;
    }

    wifi_ret = R_WIFI_SX_ULPGN_ShutdownSocket (pxContext->socket_no);
    if (WIFI_SUCCESS == wifi_ret)
    {
        lStatus = SOCKETS_ERROR_NONE;
    }
    return lStatus;
}
/*-----------------------------------------------------------*/

/**
 * @brief Closes the socket and frees the related resources.
 *
 * @param[in] xSocket The handle of the socket to close.
 *
 * @return
 * * On success, 0 is returned.
 * * If an error occurred, a negative value is returned. @ref SocketsErrors
 */
int32_t SOCKETS_Close(Socket_t xSocket)
{
    SSOCKETContextPtr_t pxContext = (SSOCKETContextPtr_t ) xSocket; /*lint !e9087 cast used for portability. */

    if (( NULL != pxContext) && (SOCKETS_INVALID_SOCKET != pxContext)
            && (pxContext->socket_no < MAX_NUM_SSOCKETS))
    {
        if (xSemaphoreTake( xUcInUse, xMaxSemaphoreBlockTime) != pdTRUE)
        {
            return SOCKETS_SOCKET_ERROR;
        }
        if ( NULL != pxContext->pcDestination)
        {
            vPortFree (pxContext->pcDestination);
        }

