jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/ports/secure_sockets/iot_secure_sockets.c
        if ( NULL != pxContext->pcServerCertificate)
        {
            vPortFree (pxContext->pcServerCertificate);
        }

        if ( pdTRUE == pxContext->xRequireTLS)
        {
#if defined(__RL) || defined(__CCRL__)
            NOP();
#else
        	TLS_Cleanup( pxContext->pvTLSContext );
#endif
        }
        R_WIFI_SX_ULPGN_CloseSocket (pxContext->socket_no);
        vPortFree (pxContext);
        xSemaphoreGive(xUcInUse);
    }
    else
    {
        return SOCKETS_EINVAL;
    }

    return pdFREERTOS_ERRNO_NONE;
}
/*-----------------------------------------------------------*/

/**
 * @brief Manipulates the options for the socket.
 *
 * @param[in] xSocket The handle of the socket to set the option for.
 * @param[in] lLevel Not currently used. Should be set to 0.
 * @param[in] lOptionName See @ref SetSockOptOptions.
 * @param[in] pvOptionValue A buffer containing the value of the option to set.
 * @param[in] xOptionLength The length of the buffer pointed to by pvOptionValue.
 *
 * @note Socket option support and possible values vary by port. Please see
 * PORT_SPECIFIC_LINK to check the valid options and limitations of your device.
 *
 *  - Berkeley Socket Options
 *    - @ref SOCKETS_SO_RCVTIMEO
 *      - Sets the receive timeout
 *      - pvOptionValue (TickType_t) is the number of milliseconds that the
 *      receive function should wait before timing out.
 *      - Setting pvOptionValue = 0 causes receive to wait forever.
 *      - See PORT_SPECIFIC_LINK for device limitations.
 *    - @ref SOCKETS_SO_SNDTIMEO
 *      - Sets the send timeout
 *      - pvOptionValue (TickType_t) is the number of milliseconds that the
 *      send function should wait before timing out.
 *      - Setting pvOptionValue = 0 causes send to wait forever.
 *      - See PORT_SPECIFIC_LINK for device limitations.
 *  - Non-Standard Options
 *    - @ref SOCKETS_SO_NONBLOCK
 *      - Makes a socket non-blocking.
 *      - pvOptionValue is ignored for this option.
 *  - Security Sockets Options
 *    - @ref SOCKETS_SO_REQUIRE_TLS
 *      - Use TLS for all connect, send, and receive on this socket.
 *      - This socket options MUST be set for TLS to be used, even
 *        if other secure socket options are set.
 *      - pvOptionValue is ignored for this option.
 *    - @ref SOCKETS_SO_TRUSTED_SERVER_CERTIFICATE
 *      - Set the root of trust server certificiate for the socket.
 *      - This socket option only takes effect if @ref SOCKETS_SO_REQUIRE_TLS
 *        is also set.  If @ref SOCKETS_SO_REQUIRE_TLS is not set,
 *        this option will be ignored.
 *      - pvOptionValue is a pointer to the formatted server certificate.
 *        TODO: Link to description of how to format certificates with \n
 *      - xOptionLength (BaseType_t) is the length of the certificate
 *        in bytes.
 *    - @ref SOCKETS_SO_SERVER_NAME_INDICATION
 *      - Use Server Name Indication (SNI)
 *      - This socket option only takes effect if @ref SOCKETS_SO_REQUIRE_TLS
 *        is also set.  If @ref SOCKETS_SO_REQUIRE_TLS is not set,
 *        this option will be ignored.
 *      - pvOptionValue is a pointer to a string containing the hostname
 *      - xOptionLength is the length of the hostname string in bytes.
 *
 * @return
 * * On success, 0 is returned.
 * * If an error occured, a negative value is returned. @ref SocketsErrors
 */
int32_t SOCKETS_SetSockOpt(Socket_t xSocket, int32_t lLevel, int32_t lOptionName, const void *pvOptionValue,
        size_t xOptionLength)
{
    int32_t lStatus = SOCKETS_ERROR_NONE;
    TickType_t xTimeout;
    SSOCKETContextPtr_t pxContext = (SSOCKETContextPtr_t ) xSocket; /*lint !e9087 cast used for portability. */

    if ((xSocket != SOCKETS_INVALID_SOCKET) && (xSocket != NULL))	// RX65N Cloud Kit 20200923
    {
        switch (lOptionName)
        {
            case SOCKETS_SO_SERVER_NAME_INDICATION:

#if (__CCRL__)
                if (WIFI_SOCKET_STATUS_CLOSED
                        == R_WIFI_SX_ULPGN_GetTcpSocketStatus ((uint8_t) (pxContext->xSocket)))
                {
                    lStatus = SOCKETS_EISCONN;
                }
                else if (WIFI_SUCCESS != R_WIFI_SX_ULPGN_RequestTlsSocket (pxContext->socket_no))
                {
                    lStatus = SOCKETS_ENOPROTOOPT;
                }
                /* Non-NULL destination string indicates that SNI extension should
                 * be used during TLS negotiation. */
                else if ( NULL == (pxContext->pcDestination = (char*) pvPortMalloc (1U + xOptionLength)))
                {
                    lStatus = SOCKETS_ENOMEM;
                }
                else
                {
                    memcpy(pxContext->pcDestination, pvOptionValue, xOptionLength);
                    pxContext->pcDestination[xOptionLength] = '\0';
                }
#else
                /* Do not set the SNI options if the socket is possibly already connected. */
                if (pxContext->xConnectAttempted == pdTRUE)	// RX65N Cloud Kit 20200923
                {
                    lStatus = SOCKETS_EISCONN;
                }
                /* Non-NULL destination string indicates that SNI extension should
                 * be used during TLS negotiation. */
                else    // RX65N Cloud Kit 20200923
                if ( NULL == (pxContext->pcDestination = (char*) pvPortMalloc (1U + xOptionLength)))
                {
                    lStatus = SOCKETS_ENOMEM;
                }
                else
                {
                    memcpy(pxContext->pcDestination, pvOptionValue, xOptionLength);
                    pxContext->pcDestination[xOptionLength] = '\0';
                }
#endif

            break;

            case SOCKETS_SO_TRUSTED_SERVER_CERTIFICATE:

                /* Do not set the trusted server certificate if the socket is possibly already connected. */
                if (pxContext->xConnectAttempted == pdTRUE)	// RX65N Cloud Kit 20200923
                {
                    lStatus = SOCKETS_EISCONN;
                }
                /* Non-NULL server certificate field indicates that the default trust
                 * list should not be used. */
                else    // RX65N Cloud Kit 20200923
#if (__CCRL__)
                if (WIFI_SUCCESS != R_WIFI_SX_ULPGN_RequestTlsSocket (pxContext->socket_no))
                {
                    lStatus = SOCKETS_ENOPROTOOPT;
                }
#else
                if ( NULL == (pxContext->pcServerCertificate = (char*) pvPortMalloc (xOptionLength)))
                {
                    lStatus = SOCKETS_ENOMEM;
                }
                else
                {
                    memcpy(pxContext->pcServerCertificate, pvOptionValue, xOptionLength);
                    pxContext->ulServerCertificateLength = xOptionLength;
                }
#endif
            break;

            case SOCKETS_SO_REQUIRE_TLS:
// RX65N Cloud Kit 20200923 -->>
//				pxContext->xRequireTLS = pdTRUE;
//				break;

                /* Do not set the TLS option if the socket is possibly already connected. */
                if (pxContext->xConnectAttempted == pdTRUE)
                {
                    lStatus = SOCKETS_EISCONN;
                }
                else if(WIFI_SUCCESS != R_WIFI_SX_ULPGN_RequestTlsSocket(pxContext->socket_no))
                {
                    lStatus = SOCKETS_ENOPROTOOPT;
                }
                else
                {
                    pxContext->xRequireTLS = pdTRUE;
                }
            break;
// RX65N Cloud Kit 20200923 <<--

            case SOCKETS_SO_NONBLOCK:
// RX65N Cloud Kit 20200923 -->>
//            pxContext->ulSendTimeout = 1000;
//            pxContext->ulRecvTimeout = 2;
//            break;

