jprofeta-rea/amazon-freertos/vendors/renesas/boards/rl78g23-fpb/ports/secure_sockets/iot_secure_sockets.c
                if ( pdTRUE == pxContext->xConnectAttempted)
                {
                    pxContext->ulSendTimeout = 1000;
                    pxContext->ulRecvTimeout = 2;
                }
                else
                {
                    lStatus = SOCKETS_EISCONN;
                }
            break;
// RX65N Cloud Kit 20200923 <<--

            case SOCKETS_SO_RCVTIMEO:
                /* Comply with Berkeley standard - a 0 timeout is wait forever. */
                xTimeout = *((const TickType_t*) pvOptionValue); /*lint !e9087 pvOptionValue passed should be of TickType_t */

                if (xTimeout == 0U)
                {
                    xTimeout = portMAX_DELAY;
                }
                pxContext->ulRecvTimeout = xTimeout;
            break;
            case SOCKETS_SO_SNDTIMEO:
                /* Comply with Berkeley standard - a 0 timeout is wait forever. */
                xTimeout = *((const TickType_t*) pvOptionValue); /*lint !e9087 pvOptionValue passed should be of TickType_t */

                if (xTimeout == 0U)
                {
                    xTimeout = portMAX_DELAY;
                }
                pxContext->ulSendTimeout = xTimeout;
            break;

            default:
                lStatus = SOCKETS_ENOPROTOOPT;
//            FreeRTOS_setsockopt( pxContext->xSocket,
//                                           lLevel,
//                                           lOptionName,
//                                           pvOptionValue,
//                                           xOptionLength );
            break;
        }
    }
    else
    {
        lStatus = SOCKETS_EINVAL;
    }

    return lStatus;
}
/*-----------------------------------------------------------*/

/**
 * @brief Resolve a host name using Domain Name Service.
 *
 * @param[in] pcHostName The host name to resolve.
 * @return
 * * The IPv4 address of the specified host.
 * * If an error has occured, 0 is returned.
 */
uint32_t SOCKETS_GetHostByName(const char *pcHostName)
{
    uint32_t ulAddr = 0;
    uint32_t ret;

    ret = R_WIFI_SX_ULPGN_DnsQuery ((uint8_t SCI_FAR*)pcHostName, &ulAddr);
    if (0 == ret)
    {
        ulAddr = SOCKETS_htonl(ulAddr);
    }
    return ulAddr;
}
/*-----------------------------------------------------------*/

/**
 * @brief Secure Sockets library initialization function.
 *
 * This function does general initialization and setup. It must be called once
 * and only once before calling any other function.
 *
 * @return
 * * @ref pdPASS if everything succeeds
 * * @ref pdFAIL otherwise.
 */
BaseType_t SOCKETS_Init(void)
{
    /* FIX ME. */
    BaseType_t xResult = pdFAIL;

    /* Create the global mutex which is used to ensure
     * that only one socket is accessing the ucInUse bits in
     * the socket array. */
    xUcInUse = xSemaphoreCreateMutex();
    if (xUcInUse == NULL)
    {
        return pdFAIL;
    }
    xResult = pdPASS;
    /* Success. */

    return xResult;
}
/*-----------------------------------------------------------*/

#if !defined(__RL) || !defined(__CCRL__)
static CK_RV prvSocketsGetCryptoSession( CK_SESSION_HANDLE * pxSession,
                                         CK_FUNCTION_LIST_PTR_PTR ppxFunctionList )
{
    CK_RV xResult = 0;
    CK_C_GetFunctionList pxCkGetFunctionList = NULL;
    static CK_SESSION_HANDLE xPkcs11Session = 0;
    static CK_FUNCTION_LIST_PTR pxPkcs11FunctionList = NULL;
    CK_ULONG ulCount = 1;
    CK_SLOT_ID xSlotId = 0;

    portENTER_CRITICAL();

    if( 0 == xPkcs11Session )
    {
        /* One-time initialization. */

        /* Ensure that the PKCS#11 module is initialized. */
        if( 0 == xResult )
        {
            pxCkGetFunctionList = C_GetFunctionList;
            xResult = pxCkGetFunctionList( &pxPkcs11FunctionList );
        }

        if( 0 == xResult )
        {
            xResult = pxPkcs11FunctionList->C_Initialize( NULL );
        }

        /* Get the default slot ID. */
        if( ( 0 == xResult ) || ( CKR_CRYPTOKI_ALREADY_INITIALIZED == xResult ) )
        {
            xResult = pxPkcs11FunctionList->C_GetSlotList( CK_TRUE,
                                                           &xSlotId,
                                                           &ulCount );
        }

        /* Start a session with the PKCS#11 module. */
        if( 0 == xResult )
        {
            xResult = pxPkcs11FunctionList->C_OpenSession( xSlotId,
                                                           CKF_SERIAL_SESSION,
                                                           NULL,
                                                           NULL,
                                                           &xPkcs11Session );
        }
    }

    portEXIT_CRITICAL();

    /* Output the shared function pointers and session handle. */
    *ppxFunctionList = pxPkcs11FunctionList;
    *pxSession = xPkcs11Session;

    return xResult;
}
/*-----------------------------------------------------------*/

/**
 * @brief Generate a TCP Initial Sequence Number that is reasonably difficult
 * to predict, per https://tools.ietf.org/html/rfc6528.
 */
uint32_t ulApplicationGetNextSequenceNumber( uint32_t ulSourceAddress,
                                             uint16_t usSourcePort,
                                             uint32_t ulDestinationAddress,
                                             uint16_t usDestinationPort )
{
    CK_RV xResult = 0;
    CK_SESSION_HANDLE xPkcs11Session = 0;
    CK_FUNCTION_LIST_PTR pxPkcs11FunctionList = NULL;
    CK_MECHANISM xMechSha256 = { 0 };
    uint8_t ucSha256Result[ cryptoSHA256_DIGEST_BYTES ];
    CK_ULONG ulLength = sizeof( ucSha256Result );
    uint32_t ulNextSequenceNumber = 0;
    static uint64_t ullKey = 0;

    /* Acquire a crypto session handle. */
    xResult = prvSocketsGetCryptoSession( &xPkcs11Session,
                                          &pxPkcs11FunctionList );

    if( 0 == xResult )
    {
        if( 0 == ullKey )
        {
            /* One-time initialization, per boot, of the random seed. */
            xResult = pxPkcs11FunctionList->C_GenerateRandom( xPkcs11Session,
                                                              ( CK_BYTE_PTR ) &ullKey,
                                                              sizeof( ullKey ) );
        }
    }

